In [2]:
import pandas as pd;

In [3]:
pd.__version__

'2.2.3'

In [7]:
data = {
    'name':['vishal', 'om', 'shubz'],
    'age':[22,12,22],
    'salary':[50000, 40000, 50000],
    'Department':['Computer', 'Chemical', 'cs']
}

df = pd.DataFrame(data)
print(df)

     name  age  salary Department
0  vishal   22   50000   Computer
1      om   12   40000   Chemical
2   shubz   22   50000         cs

In [13]:
df.loc[df.name == 'vishal']  #Selecting rows

     name  age  salary Department
0  vishal   22   50000   Computer

In [16]:
df.loc[(df.name == 'om') & (df.age >= 21)]

Empty DataFrame
Columns: [name, age, salary, Department]
Index: []

In [19]:
df[['name','age']] # Selecting Coloumn

     name  age
0  vishal   22
1      om   12
2   shubz   22

In [21]:
df['age'] >= 21

0     True
1    False
2     True
Name: age, dtype: bool

In [22]:
df[(df['age'] >= 21) & (df['salary'] >= 50000)]

     name  age  salary Department
0  vishal   22   50000   Computer
2   shubz   22   50000         cs

In [23]:
df

     name  age  salary Department
0  vishal   22   50000   Computer
1      om   12   40000   Chemical
2   shubz   22   50000         cs

In [25]:
df[['Department', 'name']]

  Department    name
0   Computer  vishal
1   Chemical      om
2         cs   shubz

In [26]:
df

     name  age  salary Department
0  vishal   22   50000   Computer
1      om   12   40000   Chemical
2   shubz   22   50000         cs

In [27]:
df.loc[df.name == 'vishal']

     name  age  salary Department
0  vishal   22   50000   Computer

In [28]:
df.loc[df.name == 'om']

  name  age  salary Department
1   om   12   40000   Chemical

In [29]:
df

     name  age  salary Department
0  vishal   22   50000   Computer
1      om   12   40000   Chemical
2   shubz   22   50000         cs

In [31]:
df[['name', 'age']]

     name  age
0  vishal   22
1      om   12
2   shubz   22

In [32]:
df

     name  age  salary Department
0  vishal   22   50000   Computer
1      om   12   40000   Chemical
2   shubz   22   50000         cs

In [33]:
df.loc[df.name == 'vishal']

     name  age  salary Department
0  vishal   22   50000   Computer

In [34]:
df

     name  age  salary Department
0  vishal   22   50000   Computer
1      om   12   40000   Chemical
2   shubz   22   50000         cs

In [35]:
df['age'] >= 21

0     True
1    False
2     True
Name: age, dtype: bool

In [37]:
df[(df['age'] >= 21) & (df['salary'] >= 50000)]

     name  age  salary Department
0  vishal   22   50000   Computer
2   shubz   22   50000         cs

In [38]:
df

     name  age  salary Department
0  vishal   22   50000   Computer
1      om   12   40000   Chemical
2   shubz   22   50000         cs

In [40]:
df['Team'] = ['Hr', 'It', 'Ceo']

In [41]:
df

     name  age  salary Department Team
0  vishal   22   50000   Computer   Hr
1      om   12   40000   Chemical   It
2   shubz   22   50000         cs  Ceo

In [48]:
df.drop('Team', axis=1)

     name  age  salary Department
0  vishal   22   50000   Computer
1      om   12   40000   Chemical
2   shubz   22   50000         cs

In [49]:
df

     name  age  salary Department Team
0  vishal   22   50000   Computer   Hr
1      om   12   40000   Chemical   It
2   shubz   22   50000         cs  Ceo

In [51]:
Delete_Column = df.drop('Team', axis=1)

In [54]:
print(Delete_Column)

     name  age  salary Department
0  vishal   22   50000   Computer
1      om   12   40000   Chemical
2   shubz   22   50000         cs

In [55]:
print(df)

     name  age  salary Department Team
0  vishal   22   50000   Computer   Hr
1      om   12   40000   Chemical   It
2   shubz   22   50000         cs  Ceo

In [56]:
add_Column = df['Year'] = [1,2,3]

In [57]:
add_Column

[1, 2, 3]

In [58]:
df

     name  age  salary Department Team  Year
0  vishal   22   50000   Computer   Hr     1
1      om   12   40000   Chemical   It     2
2   shubz   22   50000         cs  Ceo     3

In [59]:
remove = df.drop('Year', axis=1)

In [60]:
remove

     name  age  salary Department Team
0  vishal   22   50000   Computer   Hr
1      om   12   40000   Chemical   It
2   shubz   22   50000         cs  Ceo